Revit 2027 API
MEPCurveType.MultiShapeTransition Property
The default multi shape transition fitting of the MEP curve type.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public FamilySymbol MultiShapeTransition { get; set; }
Public Property MultiShapeTransition As FamilySymbol
	Get
	Set
public:
property FamilySymbol^ MultiShapeTransition {
	FamilySymbol^ get ();
	void set (FamilySymbol^ value);
}
member MultiShapeTransition : FamilySymbol with get, set
Property Value
FamilySymbol
Remarks
This property is used to retrieve the default multi shape transition fitting of the MEP curve type, and can be null if there is no default value. Use RoutingPreferenceManager to set this property for PipeType MEPCurves.
See Also
Reference
MEPCurveType Class
Autodesk.Revit.DB Namespace